Revit 2024 API
KeyBasedTreeEntriesLoadContent.Reset Method
 Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void Reset()
Visual Basic
Public Sub Reset
Visual C++
public:
void Reset()
Remarks
 This method can be used to clear all data that has been added to this KeyBasedTreeEntriesLoadContent object to date so that the caller can start adding and building KeyBasedTreeEntries again.
See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace